{"format": "layers-model", "generatedBy": null, "convertedBy": "TensorFlow.js Converter v1.0.1", "modelTopology": null, "weightsManifest": [{"paths": ["group1-shard1of28.bin", "group1-shard2of28.bin", "group1-shard3of28.bin", "group1-shard4of28.bin", "group1-shard5of28.bin", "group1-shard6of28.bin", "group1-shard7of28.bin", "group1-shard8of28.bin", "group1-shard9of28.bin", "group1-shard10of28.bin", "group1-shard11of28.bin", "group1-shard12of28.bin", "group1-shard13of28.bin", "group1-shard14of28.bin", "group1-shard15of28.bin", "group1-shard16of28.bin", "group1-shard17of28.bin", "group1-shard18of28.bin", "group1-shard19of28.bin", "group1-shard20of28.bin", "group1-shard21of28.bin", "group1-shard22of28.bin", "group1-shard23of28.bin", "group1-shard24of28.bin", "group1-shard25of28.bin", "group1-shard26of28.bin", "group1-shard27of28.bin", "group1-shard28of28.bin"], "weights": [{"name": "conv1/kernel", "shape": [7, 7, 3, 64], "dtype": "float32"}, {"name": "conv1/bias", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/bn_conv1_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/bn_conv1_beta", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/bn_conv1_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn_conv1/bn_conv1_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2a/kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/bn2a_branch2a_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/bn2a_branch2a_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/bn2a_branch2a_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2a/bn2a_branch2a_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2a_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/bn2a_branch2b_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/bn2a_branch2b_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/bn2a_branch2b_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2a_branch2b/bn2a_branch2b_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2a_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "res2a_branch1/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2a_branch1/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/bn2a_branch2c_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/bn2a_branch2c_beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/bn2a_branch2c_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch2c/bn2a_branch2c_running_std", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/bn2a_branch1_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/bn2a_branch1_beta", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/bn2a_branch1_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2a_branch1/bn2a_branch1_running_std", "shape": [256], "dtype": "float32"}, {"name": "res2b_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2b_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/bn2b_branch2a_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/bn2b_branch2a_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/bn2b_branch2a_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2a/bn2b_branch2a_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2b_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2b_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/bn2b_branch2b_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/bn2b_branch2b_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/bn2b_branch2b_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2b_branch2b/bn2b_branch2b_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2b_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2b_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/bn2b_branch2c_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/bn2b_branch2c_beta", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/bn2b_branch2c_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2b_branch2c/bn2b_branch2c_running_std", "shape": [256], "dtype": "float32"}, {"name": "res2c_branch2a/kernel", "shape": [1, 1, 256, 64], "dtype": "float32"}, {"name": "res2c_branch2a/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/bn2c_branch2a_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/bn2c_branch2a_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/bn2c_branch2a_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2a/bn2c_branch2a_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2c_branch2b/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "res2c_branch2b/bias", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/bn2c_branch2b_gamma", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/bn2c_branch2b_beta", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/bn2c_branch2b_running_mean", "shape": [64], "dtype": "float32"}, {"name": "bn2c_branch2b/bn2c_branch2b_running_std", "shape": [64], "dtype": "float32"}, {"name": "res2c_branch2c/kernel", "shape": [1, 1, 64, 256], "dtype": "float32"}, {"name": "res2c_branch2c/bias", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/bn2c_branch2c_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/bn2c_branch2c_beta", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/bn2c_branch2c_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn2c_branch2c/bn2c_branch2c_running_std", "shape": [256], "dtype": "float32"}, {"name": "res3a_branch2a/kernel", "shape": [1, 1, 256, 128], "dtype": "float32"}, {"name": "res3a_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/bn3a_branch2a_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/bn3a_branch2a_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/bn3a_branch2a_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2a/bn3a_branch2a_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3a_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3a_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/bn3a_branch2b_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/bn3a_branch2b_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/bn3a_branch2b_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3a_branch2b/bn3a_branch2b_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3a_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3a_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "res3a_branch1/kernel", "shape": [1, 1, 256, 512], "dtype": "float32"}, {"name": "res3a_branch1/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/bn3a_branch2c_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/bn3a_branch2c_beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/bn3a_branch2c_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch2c/bn3a_branch2c_running_std", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/bn3a_branch1_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/bn3a_branch1_beta", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/bn3a_branch1_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3a_branch1/bn3a_branch1_running_std", "shape": [512], "dtype": "float32"}, {"name": "res3b_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3b_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/bn3b_branch2a_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/bn3b_branch2a_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/bn3b_branch2a_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2a/bn3b_branch2a_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3b_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3b_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/bn3b_branch2b_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/bn3b_branch2b_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/bn3b_branch2b_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3b_branch2b/bn3b_branch2b_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3b_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3b_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/bn3b_branch2c_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/bn3b_branch2c_beta", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/bn3b_branch2c_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3b_branch2c/bn3b_branch2c_running_std", "shape": [512], "dtype": "float32"}, {"name": "res3c_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3c_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/bn3c_branch2a_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/bn3c_branch2a_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/bn3c_branch2a_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2a/bn3c_branch2a_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3c_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3c_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/bn3c_branch2b_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/bn3c_branch2b_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/bn3c_branch2b_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3c_branch2b/bn3c_branch2b_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3c_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3c_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/bn3c_branch2c_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/bn3c_branch2c_beta", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/bn3c_branch2c_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3c_branch2c/bn3c_branch2c_running_std", "shape": [512], "dtype": "float32"}, {"name": "res3d_branch2a/kernel", "shape": [1, 1, 512, 128], "dtype": "float32"}, {"name": "res3d_branch2a/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/bn3d_branch2a_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/bn3d_branch2a_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/bn3d_branch2a_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2a/bn3d_branch2a_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3d_branch2b/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "res3d_branch2b/bias", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/bn3d_branch2b_gamma", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/bn3d_branch2b_beta", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/bn3d_branch2b_running_mean", "shape": [128], "dtype": "float32"}, {"name": "bn3d_branch2b/bn3d_branch2b_running_std", "shape": [128], "dtype": "float32"}, {"name": "res3d_branch2c/kernel", "shape": [1, 1, 128, 512], "dtype": "float32"}, {"name": "res3d_branch2c/bias", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/bn3d_branch2c_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/bn3d_branch2c_beta", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/bn3d_branch2c_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn3d_branch2c/bn3d_branch2c_running_std", "shape": [512], "dtype": "float32"}, {"name": "res4a_branch2a/kernel", "shape": [1, 1, 512, 256], "dtype": "float32"}, {"name": "res4a_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/bn4a_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/bn4a_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/bn4a_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2a/bn4a_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4a_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4a_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/bn4a_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/bn4a_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/bn4a_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4a_branch2b/bn4a_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4a_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4a_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "res4a_branch1/kernel", "shape": [1, 1, 512, 1024], "dtype": "float32"}, {"name": "res4a_branch1/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/bn4a_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/bn4a_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/bn4a_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch2c/bn4a_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/bn4a_branch1_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/bn4a_branch1_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/bn4a_branch1_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4a_branch1/bn4a_branch1_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res4b_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4b_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/bn4b_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/bn4b_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/bn4b_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2a/bn4b_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4b_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4b_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/bn4b_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/bn4b_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/bn4b_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4b_branch2b/bn4b_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4b_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4b_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/bn4b_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/bn4b_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/bn4b_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4b_branch2c/bn4b_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res4c_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4c_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/bn4c_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/bn4c_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/bn4c_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2a/bn4c_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4c_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4c_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/bn4c_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/bn4c_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/bn4c_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4c_branch2b/bn4c_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4c_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4c_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/bn4c_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/bn4c_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/bn4c_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4c_branch2c/bn4c_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res4d_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4d_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/bn4d_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/bn4d_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/bn4d_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2a/bn4d_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4d_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4d_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/bn4d_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/bn4d_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/bn4d_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4d_branch2b/bn4d_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4d_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4d_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/bn4d_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/bn4d_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/bn4d_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4d_branch2c/bn4d_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res4e_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4e_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/bn4e_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/bn4e_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/bn4e_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2a/bn4e_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4e_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4e_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/bn4e_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/bn4e_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/bn4e_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4e_branch2b/bn4e_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4e_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4e_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/bn4e_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/bn4e_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/bn4e_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4e_branch2c/bn4e_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res4f_branch2a/kernel", "shape": [1, 1, 1024, 256], "dtype": "float32"}, {"name": "res4f_branch2a/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/bn4f_branch2a_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/bn4f_branch2a_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/bn4f_branch2a_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2a/bn4f_branch2a_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4f_branch2b/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "res4f_branch2b/bias", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/bn4f_branch2b_gamma", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/bn4f_branch2b_beta", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/bn4f_branch2b_running_mean", "shape": [256], "dtype": "float32"}, {"name": "bn4f_branch2b/bn4f_branch2b_running_std", "shape": [256], "dtype": "float32"}, {"name": "res4f_branch2c/kernel", "shape": [1, 1, 256, 1024], "dtype": "float32"}, {"name": "res4f_branch2c/bias", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/bn4f_branch2c_gamma", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/bn4f_branch2c_beta", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/bn4f_branch2c_running_mean", "shape": [1024], "dtype": "float32"}, {"name": "bn4f_branch2c/bn4f_branch2c_running_std", "shape": [1024], "dtype": "float32"}, {"name": "res5a_branch2a/kernel", "shape": [1, 1, 1024, 512], "dtype": "float32"}, {"name": "res5a_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/fixed_batch_normalization_1_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/fixed_batch_normalization_1_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/fixed_batch_normalization_1_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2a/fixed_batch_normalization_1_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5a_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5a_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/fixed_batch_normalization_2_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/fixed_batch_normalization_2_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/fixed_batch_normalization_2_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5a_branch2b/fixed_batch_normalization_2_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5a_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5a_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "res5a_branch1/kernel", "shape": [1, 1, 1024, 2048], "dtype": "float32"}, {"name": "res5a_branch1/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/fixed_batch_normalization_3_gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/fixed_batch_normalization_3_beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/fixed_batch_normalization_3_running_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch2c/fixed_batch_normalization_3_running_std", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/fixed_batch_normalization_4_gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/fixed_batch_normalization_4_beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/fixed_batch_normalization_4_running_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5a_branch1/fixed_batch_normalization_4_running_std", "shape": [2048], "dtype": "float32"}, {"name": "res5b_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5b_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/fixed_batch_normalization_5_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/fixed_batch_normalization_5_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/fixed_batch_normalization_5_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2a/fixed_batch_normalization_5_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5b_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5b_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/fixed_batch_normalization_6_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/fixed_batch_normalization_6_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/fixed_batch_normalization_6_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5b_branch2b/fixed_batch_normalization_6_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5b_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5b_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/fixed_batch_normalization_7_gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/fixed_batch_normalization_7_beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/fixed_batch_normalization_7_running_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5b_branch2c/fixed_batch_normalization_7_running_std", "shape": [2048], "dtype": "float32"}, {"name": "res5c_branch2a/kernel", "shape": [1, 1, 2048, 512], "dtype": "float32"}, {"name": "res5c_branch2a/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/fixed_batch_normalization_8_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/fixed_batch_normalization_8_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/fixed_batch_normalization_8_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2a/fixed_batch_normalization_8_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5c_branch2b/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "res5c_branch2b/bias", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/fixed_batch_normalization_9_gamma", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/fixed_batch_normalization_9_beta", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/fixed_batch_normalization_9_running_mean", "shape": [512], "dtype": "float32"}, {"name": "bn5c_branch2b/fixed_batch_normalization_9_running_std", "shape": [512], "dtype": "float32"}, {"name": "res5c_branch2c/kernel", "shape": [1, 1, 512, 2048], "dtype": "float32"}, {"name": "res5c_branch2c/bias", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/fixed_batch_normalization_10_gamma", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/fixed_batch_normalization_10_beta", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/fixed_batch_normalization_10_running_mean", "shape": [2048], "dtype": "float32"}, {"name": "bn5c_branch2c/fixed_batch_normalization_10_running_std", "shape": [2048], "dtype": "float32"}, {"name": "rpn_conv1/kernel", "shape": [3, 3, 1024, 512], "dtype": "float32"}, {"name": "rpn_conv1/bias", "shape": [512], "dtype": "float32"}, {"name": "rpn_out_class/kernel", "shape": [1, 1, 512, 9], "dtype": "float32"}, {"name": "rpn_out_class/bias", "shape": [9], "dtype": "float32"}, {"name": "rpn_out_regress/kernel", "shape": [1, 1, 512, 36], "dtype": "float32"}, {"name": "rpn_out_regress/bias", "shape": [36], "dtype": "float32"}, {"name": "dense_class_2/kernel", "shape": [2048, 2], "dtype": "float32"}, {"name": "dense_class_2/bias", "shape": [2], "dtype": "float32"}, {"name": "dense_regress_2/kernel", "shape": [2048, 4], "dtype": "float32"}, {"name": "dense_regress_2/bias", "shape": [4], "dtype": "float32"}]}]}